documents/images/graphio/bxdf/UsdUVTexture_23.dot
digraph {
  rankdir = LR;
    IMP_UsdUVTexture_23_image_bias [label= "add"];
    IMP_UsdUVTexture_23_image_bias[shape = box];
    IMP_UsdUVTexture_23_image_bias ->     IMP_UsdUVTexture_23_r;
    IMP_UsdUVTexture_23_r [label= "r"];
    IMP_UsdUVTexture_23_r[shape = box]; 
    IMP_UsdUVTexture_23_biasINT [label="bias"];
    IMP_UsdUVTexture_23_biasINT [shape = ellipse];
    IMP_UsdUVTexture_23_image_bias [label="add"];
    IMP_UsdUVTexture_23_biasINT -> IMP_UsdUVTexture_23_image_bias [label=".in2"];
    IMP_UsdUVTexture_23_image_scale [label= "multiply"];
    IMP_UsdUVTexture_23_image_scale[shape = box];
    IMP_UsdUVTexture_23_image_scale ->     IMP_UsdUVTexture_23_image_bias [label= "in1"];
    IMP_UsdUVTexture_23_image_bias [label= "add"];
    IMP_UsdUVTexture_23_image_bias[shape = box]; 
    IMP_UsdUVTexture_23_scaleINT [label="scale"];
    IMP_UsdUVTexture_23_scaleINT [shape = ellipse];
    IMP_UsdUVTexture_23_image_scale [label="multiply"];
    IMP_UsdUVTexture_23_scaleINT -> IMP_UsdUVTexture_23_image_scale [label=".in2"];
    IMP_UsdUVTexture_23_image_reader [label= "image"];
    IMP_UsdUVTexture_23_image_reader[shape = box];
    IMP_UsdUVTexture_23_image_reader ->     IMP_UsdUVTexture_23_image_scale [label= "in1"];
    IMP_UsdUVTexture_23_image_scale [label= "multiply"];
    IMP_UsdUVTexture_23_image_scale[shape = box]; 
    IMP_UsdUVTexture_23_fileINT [label="file"];
    IMP_UsdUVTexture_23_fileINT [shape = ellipse];
    IMP_UsdUVTexture_23_image_reader [label="image"];
    IMP_UsdUVTexture_23_fileINT -> IMP_UsdUVTexture_23_image_reader [label=".file"];
    IMP_UsdUVTexture_23_fallbackINT [label="fallback"];
    IMP_UsdUVTexture_23_fallbackINT [shape = ellipse];
    IMP_UsdUVTexture_23_image_reader [label="image"];
    IMP_UsdUVTexture_23_fallbackINT -> IMP_UsdUVTexture_23_image_reader [label=".default"];
    IMP_UsdUVTexture_23_stINT [label="st"];
    IMP_UsdUVTexture_23_stINT [shape = ellipse];
    IMP_UsdUVTexture_23_image_reader [label="image"];
    IMP_UsdUVTexture_23_stINT -> IMP_UsdUVTexture_23_image_reader [label=".texcoord"];
    IMP_UsdUVTexture_23_wrapSINT [label="wrapS"];
    IMP_UsdUVTexture_23_wrapSINT [shape = ellipse];
    IMP_UsdUVTexture_23_image_reader [label="image"];
    IMP_UsdUVTexture_23_wrapSINT -> IMP_UsdUVTexture_23_image_reader [label=".uaddressmode"];
    IMP_UsdUVTexture_23_wrapTINT [label="wrapT"];
    IMP_UsdUVTexture_23_wrapTINT [shape = ellipse];
    IMP_UsdUVTexture_23_image_reader [label="image"];
    IMP_UsdUVTexture_23_wrapTINT -> IMP_UsdUVTexture_23_image_reader [label=".vaddressmode"];
    IMP_UsdUVTexture_23_image_bias [label= "add"];
    IMP_UsdUVTexture_23_image_bias[shape = box];
    IMP_UsdUVTexture_23_image_bias ->     IMP_UsdUVTexture_23_g;
    IMP_UsdUVTexture_23_g [label= "g"];
    IMP_UsdUVTexture_23_g[shape = box]; 
    IMP_UsdUVTexture_23_image_bias [label= "add"];
    IMP_UsdUVTexture_23_image_bias[shape = box];
    IMP_UsdUVTexture_23_image_bias ->     IMP_UsdUVTexture_23_b;
    IMP_UsdUVTexture_23_b [label= "b"];
    IMP_UsdUVTexture_23_b[shape = box]; 
    IMP_UsdUVTexture_23_image_bias [label= "add"];
    IMP_UsdUVTexture_23_image_bias[shape = box];
    IMP_UsdUVTexture_23_image_bias ->     IMP_UsdUVTexture_23_a;
    IMP_UsdUVTexture_23_a [label= "a"];
    IMP_UsdUVTexture_23_a[shape = box]; 
    IMP_UsdUVTexture_23_image_bias [label= "add"];
    IMP_UsdUVTexture_23_image_bias[shape = box];
    IMP_UsdUVTexture_23_image_bias ->     IMP_UsdUVTexture_23_rgb;
    IMP_UsdUVTexture_23_rgb [label= "rgb"];
    IMP_UsdUVTexture_23_rgb[shape = box]; 
}
